Merge pull request #60 from kayaman/fixes/ai
feat: reorganizing
